In [12]:
dir

In [13]:
pwd

'/Users/pichappan/Documents/SamplePython/input'

In [14]:
cd ../input

/Users/pichappan/Documents/SamplePython/input

In [15]:
import pandas as pd

In [16]:
#df from a Excel file with tab name cyp
df1 = pd.read_excel("countries_year_population.xlsx","cyp")
df1.head()

       country  year  population
0  Afghanistan  1952     8425333
1  Afghanistan  1957     9240934
2  Afghanistan  1962    10267083
3  Afghanistan  1967    11537966
4  Afghanistan  1972    13079460

In [28]:
def convert_every_year_cell(cell):
    if cell < 1959:
        return 1901
    elif cell == 1962:
        return None
    return cell

def convert_every_country_cell(cell):
    if cell == 'Afghanistan':
        cell = None
    return cell

In [29]:
#df from a Excel file with tab name cyp
df2 = pd.read_excel("countries_year_population.xlsx","cyp", converters={
    'country':convert_every_country_cell,
    'year':convert_every_year_cell
})
df2

       country    year  population
0         None  1901.0     8425333
1         None  1901.0     9240934
2         None     NaN    10267083
3         None  1967.0    11537966
4         None  1972.0    13079460
...        ...     ...         ...
1699  Zimbabwe  1987.0     9216418
1700  Zimbabwe  1992.0    10704340
1701  Zimbabwe  1997.0    11404948
1702  Zimbabwe  2002.0    11926563
1703  Zimbabwe  2007.0    12311143

[1704 rows x 3 columns]

df2.to_excel('country_out1.xlsx', sheet_name='tab1', index=False) # write to excel without index column
df2.to_excel('country_out2.xlsx', sheet_name='tab1') # write to excel with index column at position A1
df2.to_excel('country_out1.xlsx', sheet_name='tab1', startrow=2, startcol=2) # write to excel at position C3

In [30]:
with pd.ExcelWriter('multi_tab.xlsx') as writer:
    df1.to_excel(writer, sheet_name="raw_data")
    df2.to_excel(writer, sheet_name="transformed")